# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# List
# Dependency for passion.zsh-theme
brew "coreutils"
# Dependency for nvim telescope
brew "fd"
# Fuzzy finder
brew "fzf"
# Go
brew "go"
# Lazydocker
brew "lazydocker"
# Lazygit
brew "lazygit"
# Mac App Store CLI
brew "mas"
# Neovim
brew "neovim"
# Node version manager
brew "nvm"
# OpenJDK@17 LTS
brew "openjdk@17"
# Dependency for nvim telescope
brew "ripgrep"
# tmux
brew "tmux"
# tree
brew "tree"
# Universal-ctags for nvim tagbar
brew "universal-ctags"

# Casks
# Discord
cask "discord"
# Docker
cask "docker"
# Firefox
cask "firefox"
# NerdFont FiraCode for iTerm2
cask "font-fira-code-nerd-font"
# NerdFont JetBrains Mono for iTerm2
cask "font-jetbrains-mono-nerd-font"
# Chrome
cask "google-chrome"
# Drive
cask "google-drive"
# iTerm2
cask "iterm2"
# Dependency for MS Office
# Optional, comment out if not needed
# cask "microsoft-auto-update"
# MS Office
# cask "microsoft-office"
# Conda for python
cask "miniconda"
# Obsidian
cask "obsidian"
# Keymap for window snap-to-grid
cask "rectangle"
# Selfcontrol
cask "selfcontrol"
# Spotify
cask "spotify"
# Pomodoro bar
cask "tomatobar"
# VSCode
cask "visual-studio-code"
# VLC
cask "vlc"
