tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "php"
brew "composer"
brew "coreutils"
brew "fd"
brew "fzf"
brew "go"
brew "lazygit"
brew "mysql"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "universal-ctags"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "miniconda"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "selfcontrol"
cask "spotify"
cask "tomatobar"
cask "visual-studio-code"
cask "vlc"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "timonwong.shellcheck"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
