# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# List
# TUI System Metrics
brew "bottom"
# Cmake
brew "cmake"
# Dependency for passion.zsh-theme
brew "coreutils"
# Dependency for nvim telescope
brew "fd"
# Fuzzy finder
brew "fzf"
# Ghostscript for PDF compression
brew "ghostscript"
# Go
brew "go"
# Lazygit
brew "lazygit"
# Mac App Store CLI
brew "mas"
# Neovim
brew "neovim"
# Node version manager
brew "nvm"
# Parallel
brew "parallel"
# Ripgrep
brew "ripgrep"
# tmux
brew "tmux"
# tree
brew "tree"
# Universal-ctags for nvim tagbar
brew "universal-ctags"
# zoxide
brew "zoxide"

# Casks
# Discord
cask "discord"
# Docker
cask "docker"
# Firefox
cask "firefox"
# NerdFont FiraCode for iTerm2
cask "font-fira-code-nerd-font"
# NerdFont JetBrains Mono for iTerm2
cask "font-jetbrains-mono-nerd-font"
# Chrome
cask "google-chrome"
# Drive
cask "google-drive"
# iTerm2
cask "iterm2"
# Linear
cask "linear-linear"
# Conda for python
cask "miniconda"
# Obsidian
cask "obsidian"
# Keymap for window snap-to-grid
cask "rectangle"
# Selfcontrol
cask "selfcontrol"
# Signal
cask "signal"
# Spotify
cask "spotify"
# Pomodoro bar
cask "tomatobar"
# VSCode
cask "visual-studio-code"
# VLC
cask "vlc"

# Mac App Store
# Microsoft Office
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
