# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"

# List
# A better cat(1)
brew "bat"
# TUI System Metrics
brew "bottom"
# Bun
brew "oven-sh/bun/bun"
# Cmake
brew "cmake"
# fnm - Fast Node Manager
brew "fnm"
# Fuzzy finder
brew "fzf"
# Ghostscript for PDF compression
# NOTE: this  has too many dependencies installed via brew
# brew "ghostscript"
# Go
brew "go"
# hyperfine
brew "hyperfine"
# Lazygit
brew "lazygit"
# Mac App Store CLI
brew "mas"
# Neovim
brew "neovim"
# NVTOP for GPUs
brew "nvtop"
# Parallel
brew "parallel"
# Rename
brew "rename"
# Ripgrep
brew "ripgrep"
# Starship.rs
brew "starship"
# tmux
brew "tmux"
# tree
brew "tree"
# Universal-ctags for nvim tagbar
brew "universal-ctags"
# uv
brew "uv"
# zoxide
brew "zoxide"

# Casks
# Discord
cask "discord"
# Docker
cask "docker"
# Firefox
cask "firefox"
# Interface and NerdFonts
cask "font-geist"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Ghostty
cask "ghostty"
# Chrome
cask "google-chrome"
# Linear
cask "linear-linear"
# Conda for python
cask "miniconda"
# Obsidian
cask "obsidian"
# Keymap for window snap-to-grid
cask "rectangle"
# Selfcontrol
cask "selfcontrol"
# Signal
cask "signal"
# Spotify
cask "spotify"
# VSCode
cask "visual-studio-code"
# VLC
cask "vlc"
# Zed
cask "zed"

# Mac App Store
# Microsoft Office
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
